; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p18---int100n150-m25---int100c110---s544---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level21 level70)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level21 level71)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level21 level72)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level21 level73)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level21 level74)
(sum level54 level3 level57)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level21 level75)
(sum level55 level3 level58)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level21 level76)
(sum level56 level3 level59)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level21 level77)
(sum level57 level3 level60)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level58 level3 level61)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level59 level3 level62)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level60 level3 level63)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level61 level3 level64)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level62 level3 level65)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level63 level3 level66)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level64 level3 level67)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level65 level3 level68)
(sum level65 level11 level76)
(sum level66 level3 level69)
(sum level66 level11 level77)
(sum level67 level3 level70)
(sum level68 level3 level71)
(sum level69 level3 level72)
(sum level70 level3 level73)
(sum level71 level3 level74)
(sum level72 level3 level75)
(sum level73 level3 level76)
(sum level74 level3 level77)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l2)
(fuelcost level3 l0 l2)
(connected l0 l3)
(fuelcost level13 l0 l3)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level3 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l3 l0)
(fuelcost level13 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level11 l3 l2)

(at t0 l3)
(fuel t0 level77)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l0)
(at p6 l0)
(at p7 l3)
(at p8 l2)
(at p9 l1)
(at p10 l1)
(at p11 l1)
(at p12 l3)
(at p13 l2)
(at p14 l2)
(at p15 l2)
(at p16 l2)
(at p17 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l2)
(at p3 l3)
(at p4 l0)
(at p5 l2)
(at p6 l3)
(at p7 l0)
(at p8 l3)
(at p9 l3)
(at p10 l0)
(at p11 l3)
(at p12 l1)
(at p13 l0)
(at p14 l1)
(at p15 l1)
(at p16 l0)
(at p17 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 18
2. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 18
3. (drive t0 l3 l2 level66 level11 level77)
   deleted: (at t0 l3) (fuel t0 level77)
   added: (at t0 l2) (fuel t0 level66)
   goals met: 0 of 18
4. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 18
5. (load p16 t0 l2)
   deleted: (at p16 l2)
   added: (in p16 t0)
   goals met: 0 of 18
6. (load p15 t0 l2)
   deleted: (at p15 l2)
   added: (in p15 t0)
   goals met: 0 of 18
7. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 0 of 18
8. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 0 of 18
9. (drive t0 l2 l1 level41 level25 level66)
   deleted: (at t0 l2) (fuel t0 level66)
   added: (at t0 l1) (fuel t0 level41)
   goals met: 0 of 18
10. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 1 of 18
11. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 1 of 18
12. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 1 of 18
13. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 1 of 18
14. (load p17 t0 l1)
   deleted: (at p17 l1)
   added: (in p17 t0)
   goals met: 1 of 18
15. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 1 of 18
16. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 1 of 18
17. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 18
18. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 18
19. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 2 of 18
20. (unload p15 t0 l1)
   deleted: (in p15 t0)
   added: (at p15 l1)
   goals met: 3 of 18
21. (drive t0 l1 l0 level20 level21 level41)
   deleted: (at t0 l1) (fuel t0 level41)
   added: (at t0 l0) (fuel t0 level20)
   goals met: 3 of 18
22. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 3 of 18
23. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 3 of 18
24. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 18
25. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 4 of 18
26. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 5 of 18
27. (unload p16 t0 l0)
   deleted: (in p16 t0)
   added: (at p16 l0)
   goals met: 6 of 18
28. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 7 of 18
29. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 8 of 18
30. (drive t0 l0 l2 level17 level3 level20)
   deleted: (at t0 l0) (fuel t0 level20)
   added: (at t0 l2) (fuel t0 level17)
   goals met: 8 of 18
31. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 9 of 18
32. (unload p17 t0 l2)
   deleted: (in p17 t0)
   added: (at p17 l2)
   goals met: 10 of 18
33. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 11 of 18
34. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 12 of 18
35. (drive t0 l2 l3 level6 level11 level17)
   deleted: (at t0 l2) (fuel t0 level17)
   added: (at t0 l3) (fuel t0 level6)
   goals met: 12 of 18
36. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 13 of 18
37. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 14 of 18
38. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 15 of 18
39. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 16 of 18
40. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 17 of 18
41. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 18 of 18
